
## Plan Result




<pre><code>Plan: 13 to add, 9 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_key_vault_secret.flexible_secret[&#34;DATABASE&#34;]
  * azurerm_key_vault_secret.flexible_secret[&#34;HOST&#34;]
  * azurerm_key_vault_secret.flexible_secret[&#34;PASS&#34;]
  * azurerm_key_vault_secret.flexible_secret[&#34;PORT&#34;]
  * azurerm_key_vault_secret.flexible_secret[&#34;USER&#34;]
  * module.postgresql.azurerm_postgresql_flexible_server.pgsql_server
  * module.postgresql.azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_adadmin
  * module.postgresql.azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_principal_admin[0]
  * module.postgresql.azurerm_postgresql_flexible_server_configuration.pgsql_server_config[&#34;backslash_quote&#34;]
  * module.postgresql.azurerm_postgresql_flexible_server_database.pg_databases[&#34;accountmanagement&#34;]
  * module.postgresql.azurerm_resource_group.rg[0]
  * module.postgresql.null_resource.set-user-permissions-additionaldbs[&#34;accountmanagement&#34;]
  * module.postgresql.random_password.password
* Update
  * azurerm_key_vault_secret.sdp-database
  * azurerm_key_vault_secret.sdp-host
  * azurerm_key_vault_secret.sdp-port
  * azurerm_key_vault_secret.secret[&#34;DATABASE&#34;]
  * azurerm_key_vault_secret.secret[&#34;HOST&#34;]
  * azurerm_key_vault_secret.secret[&#34;PASS&#34;]
  * azurerm_key_vault_secret.secret[&#34;PORT&#34;]
  * azurerm_key_vault_secret.secret[&#34;USER&#34;]
  * module.database.azurerm_postgresql_server.postgres-paas


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.flexible_secret["DATABASE"] will be created
  + resource "azurerm_key_vault_secret" "flexible_secret" {
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-ss-stg-rg/providers/Microsoft.KeyVault/vaults/pip-ss-kv-stg"
      + name                    = "account-management-POSTGRES-FLEXIBLE-DATABASE"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = {
          + "application"         = "publishing-information-service"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/pip-account-management.git"
          + "businessArea"        = "Cross-Cutting"
          + "contactSlackChannel" = "#publishing-and-information"
          + "environment"         = "staging"
          + "managedBy"           = "Future Hearings - Publishing Information Project"
          + "source"              = "account-management PostgreSQL"
        }
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.flexible_secret["HOST"] will be created
  + resource "azurerm_key_vault_secret" "flexible_secret" {
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-ss-stg-rg/providers/Microsoft.KeyVault/vaults/pip-ss-kv-stg"
      + name                    = "account-management-POSTGRES-FLEXIBLE-HOST"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = {
          + "application"         = "publishing-information-service"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/pip-account-management.git"
          + "businessArea"        = "Cross-Cutting"
          + "contactSlackChannel" = "#publishing-and-information"
          + "environment"         = "staging"
          + "managedBy"           = "Future Hearings - Publishing Information Project"
          + "source"              = "account-management PostgreSQL"
        }
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.flexible_secret["PASS"] will be created
  + resource "azurerm_key_vault_secret" "flexible_secret" {
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-ss-stg-rg/providers/Microsoft.KeyVault/vaults/pip-ss-kv-stg"
      + name                    = "account-management-POSTGRES-FLEXIBLE-PASS"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = {
          + "application"         = "publishing-information-service"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/pip-account-management.git"
          + "businessArea"        = "Cross-Cutting"
          + "contactSlackChannel" = "#publishing-and-information"
          + "environment"         = "staging"
          + "managedBy"           = "Future Hearings - Publishing Information Project"
          + "source"              = "account-management PostgreSQL"
        }
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.flexible_secret["PORT"] will be created
  + resource "azurerm_key_vault_secret" "flexible_secret" {
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-ss-stg-rg/providers/Microsoft.KeyVault/vaults/pip-ss-kv-stg"
      + name                    = "account-management-POSTGRES-FLEXIBLE-PORT"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = {
          + "application"         = "publishing-information-service"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/pip-account-management.git"
          + "businessArea"        = "Cross-Cutting"
          + "contactSlackChannel" = "#publishing-and-information"
          + "environment"         = "staging"
          + "managedBy"           = "Future Hearings - Publishing Information Project"
          + "source"              = "account-management PostgreSQL"
        }
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.flexible_secret["USER"] will be created
  + resource "azurerm_key_vault_secret" "flexible_secret" {
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-ss-stg-rg/providers/Microsoft.KeyVault/vaults/pip-ss-kv-stg"
      + name                    = "account-management-POSTGRES-FLEXIBLE-USER"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = {
          + "application"         = "publishing-information-service"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/pip-account-management.git"
          + "businessArea"        = "Cross-Cutting"
          + "contactSlackChannel" = "#publishing-and-information"
          + "environment"         = "staging"
          + "managedBy"           = "Future Hearings - Publishing Information Project"
          + "source"              = "account-management PostgreSQL"
        }
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.sdp-database will be updated in-place
  ~ resource "azurerm_key_vault_secret" "sdp-database" {
      ~ expiration_date         = "2024-09-11T14:50:51Z" -> (known after apply)
        id                      = "https://pip-ss-sdp-kv-stg.vault.azure.net/secrets/account-management-POSTGRES-DATABASE/c97a1b08f6954efda1a16a0c6dad823a"
        name                    = "account-management-POSTGRES-DATABASE"
        tags                    = {
            "application"         = "publishing-information-service"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/pip-account-management.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#publishing-and-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Publishing Information Project"
            "source"              = "account-management PostgreSQL"
        }
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.sdp-host will be updated in-place
  ~ resource "azurerm_key_vault_secret" "sdp-host" {
      ~ expiration_date         = "2024-09-11T14:50:51Z" -> (known after apply)
        id                      = "https://pip-ss-sdp-kv-stg.vault.azure.net/secrets/account-management-POSTGRES-HOST/aea7bdc5785448cfaec4cb555d408bf3"
        name                    = "account-management-POSTGRES-HOST"
        tags                    = {
            "application"         = "publishing-information-service"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/pip-account-management.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#publishing-and-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Publishing Information Project"
            "source"              = "account-management PostgreSQL"
        }
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.sdp-port will be updated in-place
  ~ resource "azurerm_key_vault_secret" "sdp-port" {
      ~ expiration_date         = "2024-09-11T14:50:51Z" -> (known after apply)
        id                      = "https://pip-ss-sdp-kv-stg.vault.azure.net/secrets/account-management-POSTGRES-PORT/4c200b3100d3422d9080f55523497219"
        name                    = "account-management-POSTGRES-PORT"
        tags                    = {
            "application"         = "publishing-information-service"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/pip-account-management.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#publishing-and-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Publishing Information Project"
            "source"              = "account-management PostgreSQL"
        }
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.secret["DATABASE"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "secret" {
      ~ expiration_date         = "2024-09-11T14:50:51Z" -> (known after apply)
        id                      = "https://pip-ss-kv-stg.vault.azure.net/secrets/account-management-POSTGRES-DATABASE/8ce251ec48bd4777a94507a628072ef9"
        name                    = "account-management-POSTGRES-DATABASE"
        tags                    = {
            "application"         = "publishing-information-service"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/pip-account-management.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#publishing-and-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Publishing Information Project"
            "source"              = "account-management PostgreSQL"
        }
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.secret["HOST"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "secret" {
      ~ expiration_date         = "2024-09-11T14:50:51Z" -> (known after apply)
        id                      = "https://pip-ss-kv-stg.vault.azure.net/secrets/account-management-POSTGRES-HOST/2859e2b055944522b249294cf60009ce"
        name                    = "account-management-POSTGRES-HOST"
        tags                    = {
            "application"         = "publishing-information-service"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/pip-account-management.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#publishing-and-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Publishing Information Project"
            "source"              = "account-management PostgreSQL"
        }
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.secret["PASS"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "secret" {
      ~ expiration_date         = "2024-09-11T14:50:51Z" -> (known after apply)
        id                      = "https://pip-ss-kv-stg.vault.azure.net/secrets/account-management-POSTGRES-PASS/ababb47721794d178d902704500de779"
        name                    = "account-management-POSTGRES-PASS"
        tags                    = {
            "application"         = "publishing-information-service"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/pip-account-management.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#publishing-and-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Publishing Information Project"
            "source"              = "account-management PostgreSQL"
        }
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.secret["PORT"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "secret" {
      ~ expiration_date         = "2024-09-11T14:50:51Z" -> (known after apply)
        id                      = "https://pip-ss-kv-stg.vault.azure.net/secrets/account-management-POSTGRES-PORT/a1035a13a62042d29439c00331f8644b"
        name                    = "account-management-POSTGRES-PORT"
        tags                    = {
            "application"         = "publishing-information-service"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/pip-account-management.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#publishing-and-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Publishing Information Project"
            "source"              = "account-management PostgreSQL"
        }
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.secret["USER"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "secret" {
      ~ expiration_date         = "2024-09-11T14:50:51Z" -> (known after apply)
        id                      = "https://pip-ss-kv-stg.vault.azure.net/secrets/account-management-POSTGRES-USER/b97f01708c6144a983fd4b46755db2f4"
        name                    = "account-management-POSTGRES-USER"
        tags                    = {
            "application"         = "publishing-information-service"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/pip-account-management.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#publishing-and-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Publishing Information Project"
            "source"              = "account-management PostgreSQL"
        }
        # (6 unchanged attributes hidden)
    }

  # module.database.azurerm_postgresql_server.postgres-paas will be updated in-place
  ~ resource "azurerm_postgresql_server" "postgres-paas" {
        id                                = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-account-management-data-staging/providers/Microsoft.DBforPostgreSQL/servers/pip-account-management-staging"
        name                              = "pip-account-management-staging"
        tags                              = {
            "application"         = "publishing-information-service"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/pip-account-management.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#publishing-and-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Publishing Information Project"
        }
        # (16 unchanged attributes hidden)

      - threat_detection_policy {
          - disabled_alerts      = [] -> null
          - email_account_admins = false -> null
          - email_addresses      = [] -> null
          - enabled              = true -> null
          - retention_days       = 0 -> null
        }
    }

  # module.postgresql.azurerm_postgresql_flexible_server.pgsql_server will be created
  + resource "azurerm_postgresql_flexible_server" "pgsql_server" {
      + administrator_login           = "accountmanagement_user"
      + administrator_password        = (sensitive value)
      + backup_retention_days         = 35
      + create_mode                   = "Default"
      + delegated_subnet_id           = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/virtualNetworks/ss-stg-vnet/subnets/postgresql"
      + fqdn                          = (known after apply)
      + geo_redundant_backup_enabled  = false
      + id                            = (known after apply)
      + location                      = "uksouth"
      + name                          = "flexible-pip-account-management-stg"
      + private_dns_zone_id           = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/private.postgres.database.azure.com"
      + public_network_access_enabled = (known after apply)
      + resource_group_name           = "flexible-pip-account-management-data-stg"
      + sku_name                      = "GP_Standard_D2s_v3"
      + storage_mb                    = 65536
      + tags                          = {
          + "application"         = "publishing-information-service"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/pip-account-management.git"
          + "businessArea"        = "Cross-Cutting"
          + "contactSlackChannel" = "#publishing-and-information"
          + "environment"         = "staging"
          + "managedBy"           = "Future Hearings - Publishing Information Project"
        }
      + version                       = "15"

      + authentication {
          + active_directory_auth_enabled = true
          + password_auth_enabled         = true
          + tenant_id                     = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
        }

      + high_availability {
          + mode = "ZoneRedundant"
        }

      + maintenance_window {
          + day_of_week  = 0
          + start_hour   = 3
          + start_minute = 0
        }
    }

  # module.postgresql.azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_adadmin will be created
  + resource "azurerm_postgresql_flexible_server_active_directory_administrator" "pgsql_adadmin" {
      + id                  = (known after apply)
      + object_id           = "e7ea2042-4ced-45dd-8ae3-e051c6551789"
      + principal_name      = "DTS Platform Operations"
      + principal_type      = "Group"
      + resource_group_name = "flexible-pip-account-management-data-stg"
      + server_name         = "flexible-pip-account-management-stg"
      + tenant_id           = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.postgresql.azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_principal_admin[0] will be created
  + resource "azurerm_postgresql_flexible_server_active_directory_administrator" "pgsql_principal_admin" {
      + id                  = (known after apply)
      + object_id           = "7ef3b6ce-3974-41ab-8512-c3ef4bb8ae01"
      + principal_name      = "jenkins-ptl-mi"
      + principal_type      = "ServicePrincipal"
      + resource_group_name = "flexible-pip-account-management-data-stg"
      + server_name         = "flexible-pip-account-management-stg"
      + tenant_id           = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.postgresql.azurerm_postgresql_flexible_server_configuration.pgsql_server_config["backslash_quote"] will be created
  + resource "azurerm_postgresql_flexible_server_configuration" "pgsql_server_config" {
      + id        = (known after apply)
      + name      = "backslash_quote"
      + server_id = (known after apply)
      + value     = "on"
    }

  # module.postgresql.azurerm_postgresql_flexible_server_database.pg_databases["accountmanagement"] will be created
  + resource "azurerm_postgresql_flexible_server_database" "pg_databases" {
      + charset   = "utf8"
      + collation = "en_GB.utf8"
      + id        = (known after apply)
      + name      = "accountmanagement"
      + server_id = (known after apply)
    }

  # module.postgresql.azurerm_resource_group.rg[0] will be created
  + resource "azurerm_resource_group" "rg" {
      + id       = (known after apply)
      + location = "uksouth"
      + name     = "flexible-pip-account-management-data-stg"
      + tags     = {
          + "application"         = "publishing-information-service"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/pip-account-management.git"
          + "businessArea"        = "Cross-Cutting"
          + "contactSlackChannel" = "#publishing-and-information"
          + "environment"         = "staging"
          + "managedBy"           = "Future Hearings - Publishing Information Project"
        }
    }

  # module.postgresql.null_resource.set-user-permissions-additionaldbs["accountmanagement"] will be created
  + resource "null_resource" "set-user-permissions-additionaldbs" {
      + id       = (known after apply)
      + triggers = {
          + "db_reader_user" = "DTS SDS DB Access Reader"
          + "name"           = "flexible-pip-account-management"
          + "script_hash"    = "f1b050abe4f2e8fc188c106259b04ba5034688164070e5ebb3e10137ad569f93"
        }
    }

  # module.postgresql.random_password.password will be created
  + resource "random_password" "password" {
      + bcrypt_hash      = (sensitive value)
      + id               = (known after apply)
      + length           = 20
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + numeric          = true
      + override_special = "()-_"
      + result           = (sensitive value)
      + special          = true
      + upper            = true
    }

Plan: 13 to add, 9 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":346,"Program":"tfcmt","SHA1":"","Vars":{}} -->